{
  "tasks": [
    {
      "id": 1,
      "title": "FASE 0: Auditoría y Actualización de Documentación Técnica",
      "description": "Revisar y actualizar toda la documentación técnica para corregir inconsistencias, verificar tecnologías obsoletas, y asegurar que la documentación refleje las decisiones técnicas actualizadas antes de comenzar la implementación.",
      "status": "done",
      "dependencies": [],
      "priority": "high",
      "subtasks": [
        {
          "id": 1,
          "title": "Auditoría de Tecnologías y Librerías",
          "description": "Verificar el estado actual de todas las tecnologías y librerías mencionadas en la documentación técnica.",
          "dependencies": [],
          "status": "done"
        },
        {
          "id": 2,
          "title": "Identificación de Inconsistencias Técnicas",
          "description": "Detectar y documentar todas las inconsistencias técnicas presentes en la documentación actual.",
          "dependencies": [1],
          "status": "done"
        },
        {
          "id": 3,
          "title": "Actualización de Referencias a Portia",
          "description": "Reemplazar todas las referencias a Portia con alternativas viables y modernas.",
          "dependencies": [1],
          "status": "done"
        },
        {
          "id": 4,
          "title": "Revisión de Arquitectura de Contenedores",
          "description": "Actualizar la documentación de arquitectura de contenedores para reflejar prácticas modernas.",
          "dependencies": [],
          "status": "done"
        },
        {
          "id": 5,
          "title": "Actualización del Documento module_scraper.md",
          "description": "Reescribir completamente el documento module_scraper.md para reflejar las tecnologías y arquitecturas actualizadas.",
          "dependencies": [],
          "status": "done"
        },
        {
          "id": 6,
          "title": "Verificación Final de Compatibilidad y Pruebas",
          "description": "Realizar pruebas de compatibilidad entre todas las tecnologías actualizadas y documentar los resultados.",
          "dependencies": [5],
          "status": "done"
        }
      ]
    },
    {
      "id": 2,
      "title": "Supabase: Configuración y Finalización de Base de Datos",
      "description": "Asegurar que la configuración de Supabase esté completa, incluyendo esquemas, tablas, vistas materializadas y funciones/triggers necesarios para el proyecto. Cubre la infraestructura de datos compartida por todos los módulos.",
      "status": "done",
      "dependencies": [1],
      "priority": "high",
      "subtasks": []
    },
    {
      "id": 3,
      "title": "Desarrollar module_connector",
      "description": "Implementar el conector que transfiere los datos desde el module_scraper hacia el module_pipeline. Gestiona la comunicación entre el módulo de scraping y el pipeline de procesamiento.",
      "status": "pending",
      "dependencies": [2],
      "priority": "high",
      "subtasks": []
    },
    {
      "id": 4,
      "title": "Desarrollar module_pipeline",
      "description": "Implementar el pipeline principal para el procesamiento de datos segmentados, aplicando LLMs para extracción de información y evaluación de importancia. Core del sistema de procesamiento de noticias.",
      "status": "pending",
      "dependencies": [2, 3],
      "priority": "high",
      "subtasks": []
    },
    {
      "id": 5,
      "title": "Desarrollar module_maintenance_scripts",
      "description": "Implementar los scripts de mantenimiento para tareas automatizadas ('IA Nocturna') como generación de embeddings, actualización de Hilos Narrativos, limpieza de datos antiguos, y optimización de base de datos.",
      "status": "pending",
      "dependencies": [2, 4],
      "priority": "high",
      "subtasks": []
    },
    {
      "id": 6,
      "title": "Desarrollar module_orchestration_agent",
      "description": "Configurar y desplegar el agente de orquestación (Prefect/Airflow) para coordinar los flujos de trabajo del sistema, especialmente los scripts de mantenimiento y el pipeline de datos. Gestiona la automatización y scheduling.",
      "status": "pending",
      "dependencies": [5],
      "priority": "high",
      "subtasks": []
    },
    {
      "id": 7,
      "title": "Configurar nginx_reverse_proxy",
      "description": "Configurar y desplegar Nginx como proxy reverso para gestionar el enrutamiento entre los diferentes módulos frontend/backend, balanceo de carga y terminación SSL.",
      "status": "pending",
      "dependencies": [2],
      "priority": "medium",
      "subtasks": []
    },
    {
      "id": 8,
      "title": "Desarrollar module_dashboard_review_backend",
      "description": "Implementar el backend de la interfaz de dashboard para que periodistas y editores revisen, validen y curen el contenido extraído. Incluye APIs para gestión de Hilos Narrativos y feedback.",
      "status": "pending",
      "dependencies": [2, 4],
      "priority": "medium",
      "subtasks": []
    },
    {
      "id": 9,
      "title": "Desarrollar module_dashboard_review_frontend",
      "description": "Implementar el frontend del dashboard de revisión con interfaz de usuario para periodistas y editores. Permite revisar artículos, gestionar Hilos Narrativos y proporcionar feedback sobre el contenido procesado.",
      "status": "pending",
      "dependencies": [7, 8],
      "priority": "medium",
      "subtasks": []
    },
    {
      "id": 10,
      "title": "Desarrollar module_chat_interface_backend",
      "description": "Implementar el backend de la interfaz de chat que permite a los usuarios interactuar con el LLM y las Query Tools para investigar la información almacenada. Incluye APIs para búsqueda semántica y generación de respuestas.",
      "status": "pending",
      "dependencies": [2, 4, 5],
      "priority": "medium",
      "subtasks": []
    },
    {
      "id": 11,
      "title": "Desarrollar module_chat_interface_frontend",
      "description": "Implementar el frontend de la interfaz de chat con experiencia de usuario optimizada para investigación periodística. Permite consultas en lenguaje natural sobre la base de conocimiento de noticias.",
      "status": "pending",
      "dependencies": [7, 10],
      "priority": "medium",
      "subtasks": []
    },
    {
      "id": 12,
      "title": "Desarrollar module_dev_interface_backend",
      "description": "Implementar el backend de la interfaz para desarrolladores que facilite la gestión, monitorización y depuración del sistema. Incluye métricas, logs centralizados y herramientas de administración.",
      "status": "pending",
      "dependencies": [4, 6],
      "priority": "low",
      "subtasks": []
    },
    {
      "id": 13,
      "title": "Desarrollar module_dev_interface_frontend",
      "description": "Implementar el frontend de la interfaz de desarrollador con dashboards de monitorización, gestión de configuraciones y herramientas de debugging para el equipo técnico.",
      "status": "pending",
      "dependencies": [7, 12],
      "priority": "low",
      "subtasks": []
    },
    {
      "id": 14,
      "title": "Integración y Testing del Sistema Completo",
      "description": "Realizar pruebas de integración end-to-end de todos los módulos, validar el flujo completo de datos desde scraping hasta interfaces de usuario, y optimizar el rendimiento del sistema.",
      "status": "pending",
      "dependencies": [9, 11, 13],
      "priority": "high",
      "subtasks": []
    },
    {
      "id": 15,
      "title": "Despliegue y Configuración de Producción",
      "description": "Configurar el entorno de producción, implementar CI/CD pipelines, configurar monitorización y alertas, y realizar el despliegue final del sistema completo de La Máquina de Noticias.",
      "status": "pending",
      "dependencies": [14],
      "priority": "high",
      "subtasks": []
    }
  ]
}